app/controllers/admin/comments_controller.rb

    def destroy
      @comment = Comment.find(params[:id])
      @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
DELETE FROM `comments` WHERE `id` = 2