app/controllers/admin/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `user_id`, `content`) VALUES('2009-10-17 13:37:50', 'lolilol', '2009-10-17 13:37:50', NULL, 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.\r\n')
---
    def create
      @post = Post.new(params[:post])

      respond_to do |format|
        if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
UPDATE `posts` SET `content` = '<p>Lorem ipsum dolor sit amet, consectetur adipisicing elit,<br />\r\nsed do eiusmod tempor incididunt ut labore et dolore magna aliqua.\r\nUt enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.<br />\r\nDuis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.<br /><br />\r\n Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</p>\r\n', `updated_at` = '2009-10-25 23:18:23' WHERE `id` = 3
---
    def update
      @post = Post.find(params[:id])

      respond_to do |format|
        if @post.update_attributes(params[:post])