app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`permalink` = 'lolilol') LIMIT 1
INSERT INTO `comments` (`name`, `created_at`, `updated_at`, `url`, `post_id`, `user_id`, `content`, `email`) VALUES('', '2009-10-20 17:17:31', '2009-10-20 17:17:31', '', 1, NULL, '', '')
UPDATE `users` SET `updated_at` = '2009-10-17 13:28:22', `perishable_token` = 'KKbTRjgQwYRB325VDCtI', `last_request_at` = '2009-10-17 13:28:22' WHERE `id` = 1
---
  def create
    @comment = Comment.new(params[:comment])

    @comment.post_id = Post.find_by_permalink(params[:post_id])

    @comment.user = current_user

    respond_to do |format|
      if @comment.save