app/controllers/posts_controller.rb

  def show
    @post = Post.find_by_permalink(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`permalink` = 'prout-lol-y-lol') LIMIT 1