app/controllers/share_controller.rb

  def twitter

    @post = Post.find(params[:id])

    log = Share.new
    log.type = 0
    log.created_at = Time.now rescue nil
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
INSERT INTO `shares` (`created_at`, `updated_at`, `post_id`, `creator_id`, `type`) VALUES('2009-10-24 10:28:47', '2009-10-24 10:28:48', 1, 1, 0)

  def facebook

    @post = Post.find(params[:id])

    log = Share.new

    log.type = 1
    log.created_at = Time.now rescue nil
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `shares` (`created_at`, `updated_at`, `post_id`, `creator_id`, `type`) VALUES('2009-10-26 14:35:44', '2009-10-26 14:35:44', 1, 1, 1)