app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `facebook_uid`, `admin`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_name`, `last_login_ip`, `login`, `last_login_at`, `email`, `first_name`) VALUES('qdCdzWpk8pc43x5q2MP7', '2009-10-14 13:02:47', '2009-10-14 13:02:47', '3e608365739897be5c1c6130ca13bde4248bccd102305fc88e8e052edf059167122d5a9560a08b4361997cb0b2d1992905b074d91117d0e345e9fe7d4dabe1b6', 'dJcN0WO7guo4S6mLfV60', '2009-10-14 13:02:47', NULL, NULL, 0, '127.0.0.1', '0cKT3klWgfLENpGfxaUy', '2009-10-14 13:02:47', 'a84b85cb903bfba81aaeb6f2a8a0233ce5ab3abfdb6bb61af44bdfb7b6d2dec7689944b587b220fe0f8fbe7206c26603fb4218f4e8d7eba0d3f4e50987da55fc', 1, NULL, NULL, 'chollier', NULL, 'loic@chollier.com', NULL)